apache/nuttx/arch/arm/src/lpc43xx/lpc43_ehci.c
static uint16_t lpc43_read16(const uint8_t *addr)
{
#ifdef CONFIG_ENDIAN_BIG
  return (uint16_t)addr[0] << 8 | (uint16_t)addr[1];
#else
  return (uint16_t)addr[1] << 8 | (uint16_t)addr[0];
#endif
}

/****************************************************************************
 * Name: lpc43_read32
 *
 * Description:
 *   Read 32-bit little endian data
 *
 ****************************************************************************/

static inline uint32_t lpc43_read32(const uint8_t *addr)
{
#ifdef CONFIG_ENDIAN_BIG
  return (uint32_t)lpc43_read16(&addr[0]) << 16 |
         (uint32_t)lpc43_read16(&addr[2]);
#else
  return (uint32_t)lpc43_read16(&addr[2]) << 16 |
         (uint32_t)lpc43_read16(&addr[0]);
#endif
}

/****************************************************************************
 * Name: lpc43_write16
 *
 * Description:
 *   Write 16-bit little endian data
 *
 ****************************************************************************/

#if 0 /* Not used */
static void lpc43_write16(uint16_t memval, uint8_t *addr)
{
#ifdef CONFIG_ENDIAN_BIG
  addr[0] = memval & 0xff;
  addr[1] = memval >> 8;
#else
  addr[0] = memval >> 8;
  addr[1] = memval & 0xff;
#endif
}
#endif

/****************************************************************************
 * Name: lpc43_write32
 *
 * Description:
 *   Write 32-bit little endian data
 *
 ****************************************************************************/

#if 0 /* Not used */
static void lpc43_write32(uint32_t memval, uint8_t *addr)
{
#ifdef CONFIG_ENDIAN_BIG
  lpc43_write16(memval >> 16, &addr[0]);
  lpc43_write16(memval & 0xffff, &addr[2]);
#else
  lpc43_write16(memval & 0xffff, &addr[0]);
  lpc43_write16(memval >> 16, &addr[2]);
#endif
}
#endif

/****************************************************************************
 * Name: lpc43_swap16
 *
 * Description:
 *   Swap bytes on a 16-bit value
 *
 ****************************************************************************/

#ifdef CONFIG_ENDIAN_BIG
static uint16_t lpc43_swap16(uint16_t value)
{
  return ((value >> 8) & 0xff) | ((value & 0xff) << 8);
}
#endif

/****************************************************************************
 * Name: lpc43_swap32
 *
 * Description:
 *   Swap bytes on a 32-bit value
 *
 ****************************************************************************/

#ifdef CONFIG_ENDIAN_BIG
static uint32_t lpc43_swap32(uint32_t value)
{
  return (uint32_t)lpc43_swap16((uint16_t)((value >> 16) & 0xffff)) |
         (uint32_t)lpc43_swap16((uint16_t)(value & 0xffff)) << 16;
}
#endif

/****************************************************************************
 * Name: lpc43_printreg
 *
 * Description:
 *   Print the contents of a LPC43 EHCI register
 *
 ****************************************************************************/

#ifdef CONFIG_LPC43_EHCI_REGDEBUG
static void lpc43_printreg(volatile uint32_t *regaddr, uint32_t regval,
                          bool iswrite)
{
  uinfo("%08x%s%08x\n", (uintptr_t)regaddr, iswrite ? "<-" : "->", regval);
}
#endif

/****************************************************************************
 * Name: lpc43_checkreg
 *
 * Description:
 *   Check if it is time to output debug information for accesses to a LPC43
 *   EHCI register
 *
 ****************************************************************************/

#ifdef CONFIG_LPC43_EHCI_REGDEBUG
static void lpc43_checkreg(volatile uint32_t *regaddr, uint32_t regval,
                           bool iswrite)
{
  static uint32_t *prevaddr = NULL;
  static uint32_t preval = 0;
  static uint32_t count = 0;
  static bool     prevwrite = false;

  /* Is this the same value that we read from/wrote to the same register
   * last time?  Are we polling the register?  If so, suppress the output.
   */

  if (regaddr == prevaddr && regval == preval && prevwrite == iswrite)
    {
      /* Yes.. Just increment the count */

      count++;
    }
  else
    {
      /* No this is a new address or value or operation. Were there any
       * duplicate accesses before this one?
       */

      if (count > 0)
        {
          /* Yes.. Just one? */

          if (count == 1)
            {
              /* Yes.. Just one */

              lpc43_printreg(prevaddr, preval, prevwrite);
            }
          else
            {
              /* No.. More than one. */

              uinfo("[repeats %d more times]\n", count);
            }
        }

      /* Save the new address, value, count, and operation for next time */

      prevaddr  = (uint32_t *)regaddr;
      preval    = regval;
      count     = 0;
      prevwrite = iswrite;

      /* Show the new register access */

      lpc43_printreg(regaddr, regval, iswrite);
    }
}
#endif

/****************************************************************************
 * Name: lpc43_getreg
 *
 * Description:
 *   Get the contents of an LPC43 register
 *
 ****************************************************************************/

#ifdef CONFIG_LPC43_EHCI_REGDEBUG
static uint32_t lpc43_getreg(volatile uint32_t *regaddr)
{
  /* Read the value from the register */

  uint32_t regval = *regaddr;

  /* Check if we need to print this value */

  lpc43_checkreg(regaddr, regval, false);
  return regval;
}
#else
static inline uint32_t lpc43_getreg(volatile uint32_t *regaddr)
{
  return *regaddr;
}
#endif

/****************************************************************************
 * Name: lpc43_putreg
 *
 * Description:
 *   Set the contents of an LPC43 register to a value
 *
 ****************************************************************************/

#ifdef CONFIG_LPC43_EHCI_REGDEBUG
static void lpc43_putreg(uint32_t regval, volatile uint32_t *regaddr)
{
  /* Check if we need to print this value */

  lpc43_checkreg(regaddr, regval, true);

  /* Write the value */

  *regaddr = regval;
}
#else
static inline void lpc43_putreg(uint32_t regval, volatile uint32_t *regaddr)
{
  *regaddr = regval;
}
#endif

/****************************************************************************
 * Name: ehci_wait_usbsts
 *
 * Description:
 *   Wait for either (1) a field in the USBSTS register to take a specific
 *   value, (2) for a timeout to occur, or (3) a error to occur.  Return
 *   a value to indicate which terminated the wait.
 *
 ****************************************************************************/

static int ehci_wait_usbsts(uint32_t maskbits, uint32_t donebits,
                            unsigned int delay)
{
  uint32_t regval;
  unsigned int timeout;

  timeout = 0;
  do
    {
      /* Wait 5usec before trying again */

      up_udelay(5);
      timeout += 5;

