apache/nuttx/arch/arm/src/lpc43xx/lpc43_ehci.c
      /* Read the USBSTS register and check for a system error */

      regval = lpc43_getreg(&HCOR->usbsts);
      if ((regval & EHCI_INT_SYSERROR) != 0)
        {
          usbhost_trace1(EHCI_TRACE1_SYSTEMERROR, regval);
          return -EIO;
        }

      /* Mask out the bits of interest */

      regval &= maskbits;

      /* Loop until the masked bits take the specified value or until a
       * timeout occurs.
       */
    }
  while (regval != donebits && timeout < delay);

  /* We got here because either the waited for condition or a timeout
   * occurred.  Return a value to indicate which.
   */

  return (regval == donebits) ? OK : -ETIMEDOUT;
}

/****************************************************************************
 * Name: lpc43_qh_alloc
 *
 * Description:
 *   Allocate a Queue Head (QH) structure by removing it from the free list
 *
 * Assumption:  Caller holds the lock
 *
 ****************************************************************************/

static struct lpc43_qh_s *lpc43_qh_alloc(void)
{
  struct lpc43_qh_s *qh;

  /* Remove the QH structure from the freelist */

  qh = (struct lpc43_qh_s *)g_ehci.qhfree;
  if (qh)
    {
      g_ehci.qhfree = ((struct lpc43_list_s *)qh)->flink;
      memset(qh, 0, sizeof(struct lpc43_qh_s));
    }

  return qh;
}

/****************************************************************************
 * Name: lpc43_qh_free
 *
 * Description:
 *   Free a Queue Head (QH) structure by returning it to the free list
 *
 * Assumption:  Caller holds the lock
 *
 ****************************************************************************/

static void lpc43_qh_free(struct lpc43_qh_s *qh)
{
  struct lpc43_list_s *entry = (struct lpc43_list_s *)qh;

  /* Put the QH structure back into the free list */

  entry->flink  = g_ehci.qhfree;
  g_ehci.qhfree = entry;
}

/****************************************************************************
 * Name: lpc43_qtd_alloc
 *
 * Description:
 *   Allocate a Queue Element Transfer Descriptor (qTD) by removing it from
 *   the free list
 *
 * Assumption:  Caller holds the lock
 *
 ****************************************************************************/

static struct lpc43_qtd_s *lpc43_qtd_alloc(void)
{
  struct lpc43_qtd_s *qtd;

  /* Remove the qTD from the freelist */

  qtd = (struct lpc43_qtd_s *)g_ehci.qtdfree;
  if (qtd)
    {
      g_ehci.qtdfree = ((struct lpc43_list_s *)qtd)->flink;
      memset(qtd, 0, sizeof(struct lpc43_qtd_s));
    }

  return qtd;
}

/****************************************************************************
 * Name: lpc43_qtd_free
 *
 * Description:
 *   Free a Queue Element Transfer Descriptor (qTD) by returning it to the
 *   free list
 *
 * Assumption:  Caller holds the lock
 *
 ****************************************************************************/

static void lpc43_qtd_free(struct lpc43_qtd_s *qtd)
{
  struct lpc43_list_s *entry = (struct lpc43_list_s *)qtd;

  /* Put the qTD back into the free list */

  entry->flink   = g_ehci.qtdfree;
  g_ehci.qtdfree = entry;
}

/****************************************************************************
 * Name: lpc43_qh_foreach
 *
 * Description:
 *   Give the first entry in a list of Queue Head (QH) structures, call the
 *   handler for each QH structure in the list (including the one at the head
 *   of the list).
 *
 ****************************************************************************/

static int lpc43_qh_foreach(struct lpc43_qh_s *qh, uint32_t **bp,
                            foreach_qh_t handler, void *arg)
{
  struct lpc43_qh_s *next;
  uintptr_t physaddr;
  int ret;

  DEBUGASSERT(qh && handler);
  while (qh)
    {
      /* Is this the end of the list?  Check the horizontal link pointer
       * (HLP) terminate (T) bit.  If T==1, then the HLP address is not
       * valid.
       */

      physaddr = lpc43_swap32(qh->hw.hlp);
      if ((physaddr & QH_HLP_T) != 0)
        {
          /* Set the next pointer to NULL.  This will terminate the loop. */

          next = NULL;
        }

      /* Is the next QH the asynchronous list head which will always be at
       * the end of the asynchronous queue?
       */

      else if (lpc43_virtramaddr(physaddr & QH_HLP_MASK) ==
               (uintptr_t)&g_asynchead)
        {
          /* That will also terminate the loop */

          next = NULL;
        }

      /* Otherwise, there is a QH structure after this one that describes
       * another transaction.
       */

      else
        {
          physaddr = lpc43_swap32(qh->hw.hlp) & QH_HLP_MASK;
          next     = (struct lpc43_qh_s *)lpc43_virtramaddr(physaddr);
        }

      /* Perform the user action on this entry.  The action might result in
       * unlinking the entry!  But that is okay because we already have the
       * next QH pointer.
       *
       * Notice that we do not manage the back pointer (bp).  If the callout
       * uses it, it must update it as necessary.
       */

      ret = handler(qh, bp, arg);

      /* If the handler returns any non-zero value, then terminate the
       * traversal early.
       */

      if (ret != 0)
        {
          return ret;
        }

      /* Set up to visit the next entry */

      qh = next;
    }

  return OK;
}

/****************************************************************************
 * Name: lpc43_qtd_foreach
 *
 * Description:
 *   Give a Queue Head (QH) instance, call the handler for each qTD structure
 *   in the queue.
 *
 ****************************************************************************/

static int lpc43_qtd_foreach(struct lpc43_qh_s *qh, foreach_qtd_t handler,
                             void *arg)
{
  struct lpc43_qtd_s *qtd;
  struct lpc43_qtd_s *next;
  uintptr_t physaddr;
  uint32_t *bp;
  int ret;

  DEBUGASSERT(qh && handler);

  /* Handle the special case where the queue is empty */

  bp       = &qh->fqp;           /* Start of qTDs in original list */
  physaddr = lpc43_swap32(*bp);  /* Physical address of first qTD in CPU order */

  if ((physaddr & QTD_NQP_T) != 0)
    {
      return 0;
    }

  /* Start with the first qTD in the list */

  qtd  = (struct lpc43_qtd_s *)lpc43_virtramaddr(physaddr);
  next = NULL;

  /* And loop until we encounter the end of the qTD list */

