apache/nuttx/arch/arm/src/lpc43xx/lpc43_ehci.c
#ifndef CONFIG_LPC43_EHCI_PREALLOCATE
  /* Allocate a pool of free Queue Head (QH) structures */

  g_qhpool = (struct lpc43_qh_s *)
    kmm_memalign(32, CONFIG_LPC43_EHCI_NQHS * sizeof(struct lpc43_qh_s));
  if (!g_qhpool)
    {
      usbhost_trace1(EHCI_TRACE1_QHPOOLALLOC_FAILED, 0);
      return NULL;
    }
#endif

  /* Initialize the list of free Queue Head (QH) structures */

  for (i = 0; i < CONFIG_LPC43_EHCI_NQHS; i++)
    {
      /* Put the QH structure in a free list */

      lpc43_qh_free(&g_qhpool[i]);
    }

#ifndef CONFIG_LPC43_EHCI_PREALLOCATE
  /* Allocate a pool of free  Transfer Descriptor (qTD) structures */

  g_qtdpool = (struct lpc43_qtd_s *)
    kmm_memalign(32, CONFIG_LPC43_EHCI_NQTDS * sizeof(struct lpc43_qtd_s));
  if (!g_qtdpool)
    {
      usbhost_trace1(EHCI_TRACE1_QTDPOOLALLOC_FAILED, 0);
      kmm_free(g_qhpool);
      return NULL;
    }
#endif

#if !defined(CONFIG_LPC43_EHCI_PREALLOCATE) && !defined(CONFIG_USBHOST_INT_DISABLE)
  /* Allocate the periodic framelist  */

  g_framelist = (uint32_t *)
    kmm_memalign(4096, FRAME_LIST_SIZE * sizeof(uint32_t));
  if (!g_framelist)
    {
      usbhost_trace1(EHCI_TRACE1_PERFLALLOC_FAILED, 0);
      kmm_free(g_qhpool);
      kmm_free(g_qtdpool);
      return NULL;
    }
#endif

  /* Initialize the list of free Transfer Descriptor (qTD) structures */

  for (i = 0; i < CONFIG_LPC43_EHCI_NQTDS; i++)
    {
      /* Put the TD in a free list */

      lpc43_qtd_free(&g_qtdpool[i]);
    }

  /* EHCI Hardware Configuration ********************************************/

  /* Enable USB to AHB clock and to Event router */

  lpc43_pll0usbconfig();
  lpc43_pll0usbenable();

  /* Program the controller to be the USB host controller
   *
   * Fixed selections:
   *
   *   CM   = Host mode
   *   ES   = 0, Little endian mode.
   *   SLOM   Not used in host mode.
   *   VBPS = 1, off-chip power source
   *
   * Configurable selections:
   *
   *   SDIS = 1, Stream disable mode.  Eliminates overruns/underruns at
   *          the expense of some performance.
   */

#ifdef CONFIG_LPC43_EHCI_SDIS
  putreg32(USBHOST_USBMODE_CM_HOST | USBHOST_USBMODE_SDIS |
           USBHOST_USBMODE_VBPS,
           LPC43_USBDEV_USBMODE);
#else
  putreg32(USBHOST_USBMODE_CM_HOST | USBHOST_USBMODE_VBPS,
           LPC43_USBDEV_USBMODE);
#endif

  /* Host Controller Initialization. Paragraph 4.1 */

  /* Reset the EHCI hardware */

  ret = lpc43_reset();
  if (ret < 0)
    {
      usbhost_trace1(EHCI_TRACE1_RESET_FAILED, -ret);
      return NULL;
    }

  /* Re-program the USB host controller.  As implemented, lpc43_reset()
   * requires the host mode setup in order to work.  However, we lose the
   * host configuration in the reset.
   */

#ifdef CONFIG_LPC43_EHCI_SDIS
  putreg32(USBHOST_USBMODE_CM_HOST | USBHOST_USBMODE_SDIS |
           USBHOST_USBMODE_VBPS,
           LPC43_USBDEV_USBMODE);
#else
  putreg32(USBHOST_USBMODE_CM_HOST | USBHOST_USBMODE_VBPS,
           LPC43_USBDEV_USBMODE);
#endif

  /* "In order to initialize the host controller, software should perform
   *  the following steps:
   *
   *  - "Program the CTRLDSSEGMENT register with 4-Gigabyte segment where
   *     all of the interface data structures are allocated. [64-bit mode]
   *  - "Write the appropriate value to the USBINTR register to enable the
   *     appropriate interrupts.
   *  - "Write the base address of the Periodic Frame List to the
   *     PERIODICLIST BASE register. If there are no work items in the
   *     periodic schedule, all elements of the Periodic Frame List should
   *     have their T-Bits set to a one.
   *  - "Write the USBCMD register to set the desired interrupt threshold,
   *     frame list size (if applicable) and turn the host controller ON via
   *     setting the Run/Stop bit.
   *  -  Write a 1 to CONFIGFLAG register to route all ports to the EHCI
   *     controller
   *     ...
   *
   * "At this point, the host controller is up and running and the port
   *  registers will begin reporting device connects, etc. System software
   *  can enumerate a port through the reset process (where the port is in
   *  the enabled state).  At this point, the port is active with SOFs
   *  occurring down the enabled port enabled Highspeed ports, but the
   *  schedules have not yet been enabled. The EHCI Host controller will not
   *  transmit SOFs to enabled Full- or Low-speed ports."
   */

  regval  = getreg32(LPC43_CREG0);
  regval &= ~CREG0_USB0PHY;
  putreg32(regval, LPC43_CREG0);

  /* Disable all interrupts */

  lpc43_putreg(0, &HCOR->usbintr);

  /* Clear pending interrupts.  Bits in the USBSTS register are cleared by
   * writing a '1' to the corresponding bit.
   */

  lpc43_putreg(EHCI_INT_ALLINTS, &HCOR->usbsts);

#if defined(CONFIG_DEBUG_USB) && defined(CONFIG_DEBUG_INFO)
  /* Show the EHCI version */

  regval16 = lpc43_swap16(HCCR->hciversion);
  usbhost_vtrace2(EHCI_VTRACE2_HCIVERSION, regval16 >> 8, regval16 & 0xff);

  /* Verify that the correct number of ports is reported */

  regval = lpc43_getreg(&HCCR->hcsparams);
  nports = (regval & EHCI_HCSPARAMS_NPORTS_MASK) >>
           EHCI_HCSPARAMS_NPORTS_SHIFT;

  usbhost_vtrace2(EHCI_VTRACE2_HCSPARAMS, nports, regval);
  DEBUGASSERT(nports == LPC43_EHCI_NRHPORT);

  /* Show the HCCPARAMS register */

  regval = lpc43_getreg(&HCCR->hccparams);
  usbhost_vtrace1(EHCI_VTRACE1_HCCPARAMS, regval);
#endif

  /* Initialize the head of the asynchronous queue/reclamation list.
   *
   * "In order to communicate with devices via the asynchronous schedule,
   *  system software must write the ASYNDLISTADDR register with the address
   *  of a control or bulk queue head. Software must then enable the
   *  asynchronous schedule by writing a one to the Asynchronous Schedule
   *  Enable bit in the USBCMD register. In order to communicate with devices
   *  via the periodic schedule, system software must enable the periodic
   *  schedule by writing a one to the Periodic Schedule Enable bit in the
   *  USBCMD register. Note that the schedules can be turned on before the
   *  first port is reset (and enabled)."
   */

  memset(&g_asynchead, 0, sizeof(struct lpc43_qh_s));
  physaddr                     = lpc43_physramaddr((uintptr_t)&g_asynchead);
  g_asynchead.hw.hlp           = lpc43_swap32(physaddr | QH_HLP_TYP_QH);
  g_asynchead.hw.epchar        = lpc43_swap32(QH_EPCHAR_H |
                                              QH_EPCHAR_EPS_FULL);
  g_asynchead.hw.overlay.nqp   = lpc43_swap32(QH_NQP_T);
  g_asynchead.hw.overlay.alt   = lpc43_swap32(QH_NQP_T);
  g_asynchead.hw.overlay.token = lpc43_swap32(QH_TOKEN_HALTED);
  g_asynchead.fqp              = lpc43_swap32(QTD_NQP_T);

  /* Set the Current Asynchronous List Address. */

